; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v7 ?v2)
             (pred_12 ?v4 ?v3)
             (pred_11 ?v7 ?v3)
             (pred_4 ?v6 ?v7 )
	     (pred_6 ?v7)
             (pred_1 ?v13)
             (pred_2 ?v4)
             (pred_5 ?v3)
             (pred_9 ?v7)
             (pred_3 ?v4)
             (pred_10 ?v7)
             (pred_8 ))



(:action op_4
:parameters (?v8 ?v12 ?v11 ?v9)
:precondition (and (pred_1 ?v8) (pred_1 ?v12) (pred_2 ?v11) (pred_5 ?v9)
          (pred_7 ?v8 ?v12) (pred_12 ?v11 ?v9)
                   (pred_11 ?v12 ?v9) (pred_6 ?v8) 
                   (pred_9 ?v12) (pred_3 ?v11))
:effect (and  (pred_10 ?v12) (not (pred_9 ?v12))))


(:action op_3
:parameters (?v8 ?v5)
:precondition (and (pred_1 ?v8) (pred_1 ?v5)
               (pred_6 ?v8) (pred_7 ?v8 ?v5) (pred_10 ?v5))
:effect (and (pred_6 ?v5) (not (pred_6 ?v8))))

(:action op_5
:parameters (?v8 ?v11)
:precondition (and (pred_1 ?v8) (pred_2 ?v11) 
                  (pred_6 ?v8) (pred_4 ?v11 ?v8) (pred_8 ))
:effect (and (pred_3 ?v11)
   (not (pred_4 ?v11 ?v8)) (not (pred_8 ))))


(:action op_2
:parameters (?v8 ?v1 ?v10)
:precondition (and (pred_1 ?v8) (pred_2 ?v1) (pred_2 ?v10)
                  (pred_6 ?v8) (pred_3 ?v10) (pred_4 ?v1 ?v8))
:effect (and (pred_3 ?v1) (pred_4 ?v10 ?v8)
        (not (pred_3 ?v10)) (not (pred_4 ?v1 ?v8))))

(:action op_1
:parameters (?v8 ?v11)
:precondition (and (pred_1 ?v8) (pred_2 ?v11) 
                  (pred_6 ?v8) (pred_3 ?v11))
:effect (and (pred_8 ) (pred_4 ?v11 ?v8) (not (pred_3 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_04 obj_09 obj_15 obj_26 obj_17 obj_01 obj_29 obj_05 obj_25 obj_02 obj_27 obj_08 obj_20 obj_11 obj_10 obj_14 obj_06 obj_03 obj_19 obj_13 obj_12 obj_30 obj_21 obj_24
    obj_18 obj_22 obj_23
    obj_16 obj_07 obj_31
    )

    (:init
       (pred_8)

       (pred_1 obj_28)
       (pred_1 obj_04)
       (pred_1 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_26)
       (pred_1 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_29)
       (pred_1 obj_05)
       (pred_1 obj_25)
       (pred_1 obj_02)
       (pred_1 obj_27)
       (pred_1 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_11)
       (pred_1 obj_10)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_03)
       (pred_1 obj_19)
       (pred_1 obj_13)
       (pred_1 obj_12)
       (pred_1 obj_30)
       (pred_1 obj_21)
       (pred_1 obj_24)
       (pred_5 obj_18)
       (pred_5 obj_22)
       (pred_5 obj_23)
       (pred_2 obj_16)
       (pred_2 obj_07)
       (pred_2 obj_31)

       (pred_7 obj_28 obj_17)
       (pred_7 obj_28 obj_04)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_28)
       (pred_7 obj_09 obj_29)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_15 obj_26)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_26 obj_25)
       (pred_7 obj_26 obj_15)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_17 obj_28)
       (pred_7 obj_01 obj_27)
       (pred_7 obj_01 obj_29)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_29 obj_08)
       (pred_7 obj_29 obj_05)
       (pred_7 obj_29 obj_09)
       (pred_7 obj_29 obj_01)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_05 obj_25)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_05 obj_29)
       (pred_7 obj_25 obj_11)
       (pred_7 obj_25 obj_26)
       (pred_7 obj_25 obj_05)
       (pred_7 obj_02 obj_10)
       (pred_7 obj_02 obj_27)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_27 obj_14)
       (pred_7 obj_27 obj_08)
       (pred_7 obj_27 obj_01)
       (pred_7 obj_27 obj_02)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_08 obj_29)
       (pred_7 obj_08 obj_27)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_11)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_11 obj_25)
       (pred_7 obj_11 obj_20)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_10 obj_14)
       (pred_7 obj_10 obj_02)
       (pred_7 obj_14 obj_12)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_27)
       (pred_7 obj_14 obj_10)
       (pred_7 obj_06 obj_30)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_03 obj_21)
       (pred_7 obj_03 obj_19)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_19 obj_24)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_13 obj_12)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_12 obj_30)
       (pred_7 obj_12 obj_14)
       (pred_7 obj_12 obj_13)
       (pred_7 obj_30 obj_21)
       (pred_7 obj_30 obj_06)
       (pred_7 obj_30 obj_12)
       (pred_7 obj_21 obj_24)
       (pred_7 obj_21 obj_03)
       (pred_7 obj_21 obj_30)
       (pred_7 obj_24 obj_19)
       (pred_7 obj_24 obj_21)
       (pred_9 obj_14)
       (pred_9 obj_12)
       (pred_9 obj_17)
       (pred_11  obj_14 obj_18)
       (pred_11  obj_12 obj_22)
       (pred_11  obj_17 obj_23)
       (pred_10 obj_28)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_15)
       (pred_10 obj_26)
       (pred_10 obj_01)
       (pred_10 obj_29)
       (pred_10 obj_05)
       (pred_10 obj_25)
       (pred_10 obj_02)
       (pred_10 obj_27)
       (pred_10 obj_08)
       (pred_10 obj_20)
       (pred_10 obj_11)
       (pred_10 obj_10)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_19)
       (pred_10 obj_13)
       (pred_10 obj_30)
       (pred_10 obj_21)
       (pred_10 obj_24)

       (pred_12  obj_16 obj_18)
       (pred_12  obj_07 obj_22)
       (pred_12  obj_31 obj_23)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_31 obj_02)
       (pred_6 obj_11)
    )

    (:goal (and
       (pred_4 obj_31 obj_21)
    ))
(:constraints
  (always (not (pred_6 obj_20)))
)
)

; plan
1. (op_3 obj_11 obj_19)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_19)
   goals met: 0 of 1
2. (op_3 obj_19 obj_03)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_03)
   goals met: 0 of 1
3. (op_3 obj_03 obj_06)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_06)
   goals met: 0 of 1
4. (op_3 obj_06 obj_08)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_08)
   goals met: 0 of 1
5. (op_3 obj_08 obj_27)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_27)
   goals met: 0 of 1
6. (op_3 obj_27 obj_02)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_02)
   goals met: 0 of 1
7. (op_5 obj_02 obj_31)
   deleted: (pred_4 obj_31 obj_02) (pred_8)
   added: (pred_3 obj_31)
   goals met: 0 of 1
8. (op_3 obj_02 obj_27)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_27)
   goals met: 0 of 1
9. (op_3 obj_27 obj_08)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_08)
   goals met: 0 of 1
10. (op_3 obj_08 obj_06)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_06)
   goals met: 0 of 1
11. (op_3 obj_06 obj_03)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_03)
   goals met: 0 of 1
12. (op_3 obj_03 obj_21)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_21)
   goals met: 0 of 1
13. (op_1 obj_21 obj_31)
   deleted: (pred_3 obj_31)
   added: (pred_8) (pred_4 obj_31 obj_21)
   goals met: 1 of 1
